#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/opeopenomi/gcp-actions-demo/runs/run-8W8UMU2exAMJZ3bA

Waiting for the plan to start...

Terraform v1.3.2
on linux_amd64
Initializing plugins and modules...
google_storage_bucket.bucket_2: Refreshing state... [id=test-bucket-opeopenomi-2]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # google_storage_bucket.bucket_2 will be destroyed
  # (because google_storage_bucket.bucket_2 is not in configuration)
  - resource "google_storage_bucket" "bucket_2" {
      - default_event_based_hold    = false -> null
      - force_destroy               = false -> null
      - id                          = "test-bucket-opeopenomi-2" -> null
      - labels                      = {} -> null
      - location                    = "EUROPE-WEST1" -> null
      - name                        = "test-bucket-opeopenomi-2" -> null
      - project                     = "opeopenomi-dev" -> null
      - requester_pays              = false -> null
      - self_link                   = "https://www.googleapis.com/storage/v1/b/test-bucket-opeopenomi-2" -> null
      - storage_class               = "STANDARD" -> null
      - uniform_bucket_level_access = true -> null
      - url                         = "gs://test-bucket-opeopenomi-2" -> null

      - versioning {
          - enabled = true -> null
        }
    }

  # google_storage_bucket.bucket_3 will be created
  + resource "google_storage_bucket" "bucket_3" {
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "EUROPE-WEST1"
      + name                        = "test-bucket-opeopenomi-3"
      + project                     = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + versioning {
          + enabled = true
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.


```

</details>

*Pushed by: @Sofiane-Kihal, Action: `pull_request`*